[
  {
    "id": "66977",
    "title": "Traffic Trap",
    "description": "Get ready to dive into Traffic Trap, an addictive HTML5 puzzle game perfect for browser play. Control traffic flow on a busy street grid by managing the routes of trucks using directional signs and traffic lights. Each truck follows a marked direction, and one wrong move could lead to a crash! React fast, think smart, and prevent chaos as you unlock new levels with increasing complexity. Use power-ups like hints and bombs to ease tough situations. Ideal for players of all ages, Traffic Trap is optimized for mobile and desktop and is a great choice for monetization through rewarded ads or in-game purchases.",
    "instructions": "Desktop Click on trucks to change direction Mobile Tap trucks to change direction ",
    "url": "https://html5.gamemonetize.com/jaj71oz3teb57c2egenil47f6jla6fjh/",
    "category": "Clicker",
    "tags": "Brain, Casual, Clicker, HTML5, NapTech Games, Skill, Traffic, Truck, trucks",
    "thumb": "https://img.gamemonetize.com/jaj71oz3teb57c2egenil47f6jla6fjh/512x384.jpg",
    "width": "1920",
    "height": "1080"
  },
  {
    "id": "65251",
    "title": "Traffic Parking",
    "description": "Traffic Parking is a challenging car puzzle game where you guide a vehicle home by navigating around obstacles like other cars and rocks. Strategize to clear paths and unlock tricks for tricky levels.",
    "instructions": "Touch the car to see the car rsquo s path touch again to drive the car ",
    "url": "https://html5.gamemonetize.com/gyf04mppkiq7jw4lz6r441s5qiu8m7pm/",
    "category": "Puzzle",
    "tags": "2D, Cars, Logic",
    "thumb": "https://img.gamemonetize.com/gyf04mppkiq7jw4lz6r441s5qiu8m7pm/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "61414",
    "title": "Traffic Racing: Overtake Everyone",
    "description": "Dive into the exciting world of city racing! Choose a car from the garage - each car has unique characteristics and speed. Go to the city with heavy traffic, choosing between one-way or two-way traffic. Your task is to go around other cars, avoid accidents and collect coins to earn as many points as possible. On the way you will find bonuses that will help improve the characteristics of the car or get temporary boosts. The further you drive, the more money you will earn, opening access to new, faster and more powerful cars.",
    "instructions": "Start the game by choosing a car from the garage - each car has its own characteristics Then choose the driving mode one-way or two-way traffic In the city your task is to drive the car going around other cars to avoid collisions ",
    "url": "https://html5.gamemonetize.com/3fnr34cwz9g0vrk0ukrks2miqit0o00n/",
    "category": "Racing",
    "tags": "1 Player, 3D, amazing, Car, Cars, Driving, free html5 games for your website, Game, Race, Racing, Road, Traffic, transport, unity",
    "thumb": "https://img.gamemonetize.com/3fnr34cwz9g0vrk0ukrks2miqit0o00n/512x384.jpg",
    "width": "1920",
    "height": "1080"
  },
  {
    "id": "61153",
    "title": "Overtaking   Traffic Rider",
    "description": "Tap the screen to let the car enter the main road heavy traffic on the street. Control the cars at the corner to enter the main road to ensure that there are no traffic accidents.",
    "instructions": "Tap the screen to let the car enter the main road",
    "url": "https://html5.gamemonetize.com/llpxdq9m4dexzkf6w586lnpy4pao1pde/",
    "category": "Racing",
    "tags": "Car, Race",
    "thumb": "https://img.gamemonetize.com/llpxdq9m4dexzkf6w586lnpy4pao1pde/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "60482",
    "title": "Traffic Jam Escape: Car Puzzle",
    "description": "Escape the cars from hitting other cars: Traffic Clear 3D that strategize your moves to navigate through jammed roads and clear the traffic chaos. Fun and Addictive Challenges, Realistic 3D Graphics.",
    "instructions": "Tap to play",
    "url": "https://html5.gamemonetize.com/lncx63oyztfjrfnzhfkf395b2gsx73p5/",
    "category": "Puzzle",
    "tags": "3D Games, Car, Puzzle, Traffic",
    "thumb": "https://img.gamemonetize.com/lncx63oyztfjrfnzhfkf395b2gsx73p5/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "58064",
    "title": "Traffic Jam Hop On",
    "description": "In Traffic Jam: Hop On, challenge your strategy thinking and quick reflexes! This wonderful puzzle game will take you into a colorful parking lot. Your task is to help all kinds of vehicles get out of traffic jams and start smoothly.",
    "instructions": "Mouse click or tap to play ",
    "url": "https://html5.gamemonetize.com/oqs0yddepvccu05lu6pibq21lthwt8ia/",
    "category": "Puzzle",
    "tags": "Car, Parking, vehicle",
    "thumb": "https://img.gamemonetize.com/oqs0yddepvccu05lu6pibq21lthwt8ia/512x384.jpg",
    "width": "1080",
    "height": "1920"
  },
  {
    "id": "58121",
    "title": "Traffic Escape",
    "description": "Get ready for Traffic Escape &ndash; the ultimate mobile game where you take control of the chaotic city streets and free cars from traffic jams! Every second matters, and your decisions can make or break the game. Will you be able to get all the cars out of the jam? In Traffic Escape, you&rsquo;ll need to check the path for each car by looking at the arrows on top of them. Tap the cars and guide them in the right direction, making sure you avoid other vehicles along the way. Timing and strategy are everything, as even one wrong move could lead to a crash and block the way.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/w333wv3uafd4lpi7agv25hgsjmeyl2jk/",
    "category": "Puzzle",
    "tags": "Brain, Car, carparking, Cars",
    "thumb": "https://img.gamemonetize.com/w333wv3uafd4lpi7agv25hgsjmeyl2jk/512x384.jpg",
    "width": "1920",
    "height": "1080"
  },
  {
    "id": "57009",
    "title": "Traffic Escape Puzzle",
    "description": "Come to enter a complex maze in the Traffic Escape Puzzle! In this exciting puzzle game, get your car out safely. Find the right time to exit the vehicle. Be careful to avoid traffic jams and collisions. To slide the vehicle and create a clear path for cars. Each level presents a new traffic maze.",
    "instructions": "Mouse click or tap to play ",
    "url": "https://html5.gamemonetize.com/mharusz12qhmwnhnrdur8jhpovvfo43o/",
    "category": "Puzzle",
    "tags": "Cars, Traffic",
    "thumb": "https://img.gamemonetize.com/mharusz12qhmwnhnrdur8jhpovvfo43o/512x384.jpg",
    "width": "750",
    "height": "1334"
  },
  {
    "id": "55554",
    "title": "Traffic Speed Racing",
    "description": "In the game Traffic Speed Racing, we together with a young guy will take part in races with obstacles. These can be mines, pits and other hazards. You sat behind the wheel of the car will have to fly on the highway at the maximum possible speed and meet in a strictly allotted time. All obstacles you will have to pass by at speed. Also on the road can be bonus items.",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/6k1vsgz4c5smpeo6ibnhha3o4wexkyrf/",
    "category": "Racing",
    "tags": "Avoid, Cars, Driving, Mobile, Obstacle, Race, Rocket, Skill",
    "thumb": "https://img.gamemonetize.com/6k1vsgz4c5smpeo6ibnhha3o4wexkyrf/512x384.jpg",
    "width": "1280",
    "height": "720"
  },
  {
    "id": "53102",
    "title": "Urban Traffic Commander",
    "description": "I dont know about you, but I find it hard to stay focused when theres a lot of traffic. This is your chance to be in control! Take command of the traffic in the streets and redirect cars on their way. As you get through each level, get better at keeping them moving. Be careful though, those pedestrians can be tricky!",
    "instructions": "Turn On Off traffic signals by clicking on them Save collisions ",
    "url": "https://html5.gamemonetize.com/urfu3kzie4tknhx87woix3jfchxd852n/",
    "category": "Adventure",
    "tags": "1 Player, Interactive",
    "thumb": "https://img.gamemonetize.com/urfu3kzie4tknhx87woix3jfchxd852n/512x384.jpg",
    "width": "1920",
    "height": "1080"
  },
  {
    "id": "52198",
    "title": "Traffic Monster",
    "description": "Are you ready to drive fast on the highway? It&rsquo;s time to show your driving skills on high speed among the multitude of cars on the highway. All you have to do is to avoid colliding with other cars and collecting as many points as possible. You have at your disposal many car models, four game modes as a single player, 3 weather options and smooth car controls. Have fun!",
    "instructions": "- W or up arrow to accelerate - A D or left right arrow to steer car - Space bar to use handbrake",
    "url": "https://html5.gamemonetize.com/fnq9espr17eq3tl854i2lf6xxqyinvzk/",
    "category": "Racing",
    "tags": "3D, Action, Adventure, Car, Cars, Racing, Traffic",
    "thumb": "https://img.gamemonetize.com/fnq9espr17eq3tl854i2lf6xxqyinvzk/512x384.jpg",
    "width": "960",
    "height": "600"
  },
  {
    "id": "51363",
    "title": "Animal Traffic Run",
    "description": "Get ready for a wild adventure in Animal Traffic Run! In this fast-paced mobile game, youll navigate a bustling city filled with quirky animal characters. Your mission? Help these animals safely cross the busy streets and highways, avoiding traffic jams and collecting rewards. With intuitive controls and various challenges, Animal Traffic Run offers endless fun for players of all ages. Can you guide these adorable creatures to their destinations and become the ultimate traffic master? Play now and find out!",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/ecfxn61ensrc6b0qfj4yygn83hnf1ngu/",
    "category": "Arcade",
    "tags": "Adventure, Animal, Arcade, Strategy, Traffic",
    "thumb": "https://img.gamemonetize.com/ecfxn61ensrc6b0qfj4yygn83hnf1ngu/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "51288",
    "title": "Traffic Jam 3D",
    "description": "Rev up your engines and brace yourself for the ultimate gridlock showdown in Traffic Jam 3D! Take on the role of a traffic controller and dive into a chaotic world of jam-packed streets. Strategize and rearrange vehicles to create paths and guide traffic to its destination. With its intuitive controls and realistic 3D graphics, Traffic Jam 3D will test your patience and problem-solving skills like never before. Get ready to unravel the tangled web of traffic and become a master of the road!",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/mosskltnxoznaz9tau6dkha7uhphelpe/",
    "category": "Arcade",
    "tags": "3D, 3D Games, Best Games, Car, Cars, free games for your site, free games for your website, games for your website, unity games for your website, Unity3D",
    "thumb": "https://img.gamemonetize.com/mosskltnxoznaz9tau6dkha7uhphelpe/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "46538",
    "title": "Parking Jam Delivery Traffic",
    "description": "Parking Jam Delivery Traffic is a unique and awesome game. It is not a car game, but a traffic management game. You have to control the vehicles in and out, and load them with the goods you need. You can earn money and unlock more parking spaces and manage the traffic situation. Are you ready?",
    "instructions": "Click to play",
    "url": "https://html5.gamemonetize.com/2m5wywysh674dh6wstym87iazvsftblg/",
    "category": "Puzzle",
    "tags": "3D, Food, Logic, Parking, Puzzle, Simulation, Traffic",
    "thumb": "https://img.gamemonetize.com/2m5wywysh674dh6wstym87iazvsftblg/512x384.jpg",
    "width": "750",
    "height": "1334"
  },
  {
    "id": "50498",
    "title": "Super Traffic Racer",
    "description": "Super Traffic Racer is a milestone in the genre of endless arcade racing. Drive your car through highway traffic, earn cash, upgrade your car, and buy new ones. Try to be one of the fastest drivers in the global leaderboards. Endless racing is now redefined!",
    "instructions": "Touch the screen or use the arrow keys",
    "url": "https://html5.gamemonetize.com/a5w7favv4e53hhyfev78m7xs0dcefnew/",
    "category": "Racing",
    "tags": "1 Player, 3D, 3D Games, Action, Arcade, Best Games, Cars, Casual, Traffic",
    "thumb": "https://img.gamemonetize.com/a5w7favv4e53hhyfev78m7xs0dcefnew/512x384.jpg",
    "width": "800",
    "height": "480"
  },
  {
    "id": "50301",
    "title": "Crazy Traffic Racer",
    "description": "Introducing an adrenaline-pumping car driving game that will push your driving skills to the limit. Powered by a cutting-edge 3D game engine, this game delivers a realistic and immersive experience like no other.Crazy Traffic Racer boasts stunning graphics and realistic physics, immersing you in a world filled with heart-stopping moments and breathtaking scenery. With intuitive controls and responsive gameplay, youll feel every twist, turn, and crash as if you were behind the wheel yourself.",
    "instructions": "Controls Desktop W or up arrow key - accelerate A or left arrow key - turn left D or right arrow key - turn right S or down arrow key - brake Controls Mobile Tablet Left button - turn left Right button - turn right Two buttons - brake",
    "url": "https://html5.gamemonetize.com/4yc7lfrhlx6p4bp57uw4su86itmq27ij/",
    "category": "Racing",
    "tags": "1 Player, 3D, 3D Games, Car, Cars, Crazy, Fun, Mobile, Race, Racing, Traffic",
    "thumb": "https://img.gamemonetize.com/4yc7lfrhlx6p4bp57uw4su86itmq27ij/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "49740",
    "title": "Halloween Monster Traffic",
    "description": "Halloween is coming! The little monsters are ready to work! But the roads are full of cars! Can you help them find the right way? Tap the screen at the right time, and help them cross the road! Enjoy various fun obstacles and levels! What are you waiting for? Try this game! Have a spooky and happy Halloween! Have fun!",
    "instructions": "Mouse click or tap to play",
    "url": "https://html5.gamemonetize.com/9amxzsogy7tyk9v2ks1zby6kf4t8jai9/",
    "category": "Hypercasual",
    "tags": "Boys, Car, Casual, Girl, Halloween, Kids, Monster",
    "thumb": "https://img.gamemonetize.com/9amxzsogy7tyk9v2ks1zby6kf4t8jai9/512x384.jpg",
    "width": "750",
    "height": "1334"
  },
  {
    "id": "47772",
    "title": "Traffic Ride Skibidi Toilet",
    "description": "In the bustling metropolis of Trafficville, a thrilling and high-octane rivalry has emerged on the busy streets. Enter the world of Traffic Ride Motorcycle, where fearless riders steer their powerful motorcycles through the chaotic urban landscape, maneuvering through gridlocked traffic with unmatched finesse and agility. These skilled riders form an elite group committed to showcasing their prowess in navigating through the citys congested thoroughfares.",
    "instructions": "Control the bike with WASD But lurking in the shadows is an enigmatic and mischievous force known as the Skibidi Toilet Picture a peculiar and quirky vehicle shaped like a funky retro restroom on wheels ",
    "url": "https://html5.gamemonetize.com/mpi6dgs0z3zzfbf0m40qckwdn1yt1beh/",
    "category": "Racing",
    "tags": "Action, Bike, Moto, Motorcycle, Racing, Skibidi, Skibidi Toilet, Traffic, Unity3D, WebGL",
    "thumb": "https://img.gamemonetize.com/mpi6dgs0z3zzfbf0m40qckwdn1yt1beh/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "46361",
    "title": "Elite Traffic Simulator",
    "description": "Elite Traffic Simulator invites you into the thrilling world of traffic management. As the controller, youll oversee intricate road networks, ensuring smooth traffic flow while handling unexpected challenges. From controlling traffic lights to managing rush hour chaos, this immersive game tests your strategic skills and quick decision-making. Prepare for an engaging, real-time experience that transforms you into the ultimate traffic maestro. Can you keep the city moving? Jump into Elite Traffic Simulator and find out!",
    "instructions": "Mouse click or tap on the vehicles to stop them same to un-stop ",
    "url": "https://html5.gamemonetize.com/k5lupnczhmg48rwwdj2zjkgyhbp8fpx4/",
    "category": "Clicker",
    "tags": "1 Player, 3D, Action, Car, Cars, Click, Clicker, Skill, Skills, Strategy, Traffic, vehicle",
    "thumb": "https://img.gamemonetize.com/k5lupnczhmg48rwwdj2zjkgyhbp8fpx4/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "42997",
    "title": "Worlds Hardest Traffic Box ",
    "description": "World's Hardest Traffic Box is an interesting adventure puzzle online game with the theme of moving boxes. The simple and fresh picture is very logical. Avoid all kinds of obstacles in the game to let the small box reach the finish line smoothly, which tests your control of timing and speed. There are so many levels that you can't stop playing. Come and join us if you like!",
    "instructions": "Mouse or tap to play",
    "url": "https://html5.gamemonetize.com/e8w68d4gu2e1xaz3u8tnha1uiq9npp3m/",
    "category": "Boys",
    "tags": "Android, Avoid, Block, Boy, Brain, Fun, HTML5, Kid, Obstacle, Online, Puzzle",
    "thumb": "https://img.gamemonetize.com/e8w68d4gu2e1xaz3u8tnha1uiq9npp3m/512x384.jpg",
    "width": "360",
    "height": "640"
  },
  {
    "id": "41221",
    "title": "Traffic Control Math",
    "description": "This is a traffic control game where you control the flow of traffic by starting the traffic in a lane by clicking an option which shows the correct answer asked in the question. There are four sets of Arithmetic problems; each is connected to a traffic light signal. If you tap correct option for the asked question, it will make its signal green and rest all signals will be red. In each level you have to control the traffic for a limited time. Try to solve as many questions as you can, while avoiding the traffic congestion. If you tap the wrong option, you will lose the level. Game will be tougher gradually as you progress the levels.",
    "instructions": "Use mouse or touch pad to play this game ",
    "url": "https://html5.gamemonetize.com/8t628llithlupsdyzzjtsnfrgfayxavk/",
    "category": "Puzzle",
    "tags": "Educational, HTML5, Math, Mobile, Puzzle, Skill",
    "thumb": "https://img.gamemonetize.com/8t628llithlupsdyzzjtsnfrgfayxavk/512x384.jpg",
    "width": "800",
    "height": "450"
  },
  {
    "id": "40560",
    "title": "Traffic Run Puzzle",
    "description": "Traffic Run Puzzle is a popular car merge and racing simulator game. All Players can enjoy this game free online. Buy cars to merge, high-level cars can earn more money. Take it to the road to race, and watch out for other cars. Classic game-playing mode and car-driving content. Dear traffic cop, come to help them get through the intersection!",
    "instructions": "Mouse or tap to play ",
    "url": "https://html5.gamemonetize.com/a1iyxlib15f20topu7tv34tl24e8imyg/",
    "category": "Boys",
    "tags": "3D, Android, Avoid, Boy, Brain, Car, Fun, HTML5, Kids, Obstacle, Online, Puzzle, run, Traffic",
    "thumb": "https://img.gamemonetize.com/a1iyxlib15f20topu7tv34tl24e8imyg/512x384.jpg",
    "width": "750",
    "height": "1334"
  },
  {
    "id": "40483",
    "title": "Car Driving Traffic Crazy Mobile",
    "description": "Is the first-person viewpoint of so many racing games becoming old for you? Car 2: Racing is a game you might play if you want to try your luck. Being in a car gives you a bird's-eye view of the chaotic streets below you. Get where you're going fast, stay out of traffic, make money, and buy new vehicles. Reach the pinnacle of success on a global scale.",
    "instructions": "On mobile devices use the button from the screen and use WASD on PC ",
    "url": "https://html5.gamemonetize.com/78puiwd62s3buyl8bpa5602rwti4tt2q/",
    "category": "Racing",
    "tags": ".io Games, 1 Player, 3D Games, Action, Android, Car, Crazy, HTML, HTML5, Mobile, Racing, Supercars, Traffic, Unity3D, WebGL",
    "thumb": "https://img.gamemonetize.com/78puiwd62s3buyl8bpa5602rwti4tt2q/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "39143",
    "title": "Don’t Brake - Highway Traffic",
    "description": "Don’t Brake is a real life based intersection crossing Driving game though the busy city traffic. Drive your car through the busy lanes and highway traffic without colliding with other vehicles to avoid an accident. Obey Traffic Rules and enjoy safe driving! Drive your car through endless highway traffic and realistic environment, earn points & buy new cars in the best obstacle road racing game. How to play Don’t Brake - Traffic Racing & City Driving Game It’s time to drive your car through the busy city traffic with crossing vehicles. Safely cross the roads and cross ways without colliding with other vehicles. Tap on the screen to accelerate the car and go faster on the street. Release your finger to apply brakes and slow down the vehicle to avoid hitting on the road. Obey traffic rules and safely cross as many cross way you can to get a high score. Unlock new colorful vehicles & enjoy city driving! Create a high score and challenge your friends to compete in the Free driving simulator game.",
    "instructions": "Don t Brake is a real life based intersection crossing Driving game though the busy city traffic Drive your car through the busy lanes and highway traffic without colliding with other vehicles to avoid an accident Obey Traffic Rules and enjoy safe drivi",
    "url": "https://html5.gamemonetize.com/cga7lxsy8squhevbxqckymhxvqit5a1a/",
    "category": "Boys",
    "tags": "2D, Game, Traffic",
    "thumb": "https://img.gamemonetize.com/cga7lxsy8squhevbxqckymhxvqit5a1a/512x384.jpg",
    "width": "1080",
    "height": "1920"
  },
  {
    "id": "39466",
    "title": "Traffic Race Motor",
    "description": "How about a crazy ride on your motorcycle? Click on the Traffic Racing Moto game. Experience speed, excitement and adventure together. Collect extra points to buy motorcycles of different colors. Speed up without hitting the cars. Speed enthusiasts per screen!",
    "instructions": "WASD or Arrow Keys The front of the motorbike is lifted with the left SHIFT Key ",
    "url": "https://html5.gamemonetize.com/5yeolx0uxuev8oupui0r7m7p35i9nfvv/",
    "category": "Action",
    "tags": "Adventure, Boys, Car, Funny, Motorcycle",
    "thumb": "https://img.gamemonetize.com/5yeolx0uxuev8oupui0r7m7p35i9nfvv/512x384.jpg",
    "width": "800",
    "height": "450"
  },
  {
    "id": "38535",
    "title": "Traffic Car Run 2D : Car games",
    "description": "Fasten your seat belt for an exciting drive with this 2D car game. Traffic Car Run 2D: Heavy traffic game has many environments like desert, city, highway and grassy land. This is an amazing and entertaining endless traffic car game. Get a racing experience through the top traffic game by this free offline game.",
    "instructions": "",
    "url": "https://html5.gamemonetize.com/bd7kwzy2cot0569i3ueoe1n5hyi03s01/",
    "category": "Racing",
    "tags": "Game, Games, HTML5, Race, Racing",
    "thumb": "https://img.gamemonetize.com/bd7kwzy2cot0569i3ueoe1n5hyi03s01/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "38490",
    "title": "Traffic Run Nature",
    "description": "Traffic Run Nature game belongs to one of the popular car game genres. In Traffic Run Nature, there are two circular roads that intersect each other. One of these circles belongs to your car. In the other circle, trucks and cars are driven. Your task is to complete your tour by passing through other vehicles and trucks. You earn points for each round you complete. But be careful, do not crash into other vehicles. Visit ripogame.com for this and many more ublocked games. RipoGame.com wishes you good games.",
    "instructions": "Arrow Up Acceleration Arrow Down Brake",
    "url": "https://html5.gamemonetize.com/5p3aywc0sajsmpbll3zyplp2qhss9x2e/",
    "category": "Hypercasual",
    "tags": "3D, Adventure, Car, Driving, HTML5",
    "thumb": "https://img.gamemonetize.com/5p3aywc0sajsmpbll3zyplp2qhss9x2e/512x384.jpg",
    "width": "900",
    "height": "506"
  },
  {
    "id": "38253",
    "title": "Traffic Run!: Driving Game",
    "description": "Wanna go for a drive and enjoy a traffic game? Navigate your vehicle on the road to avoid traffic without crashing any cars and reach the goal. There is traffic in front of you, but you must run and drive through the traffic. If you drive carefully, you will level up easily. This game is 3D graphic so you feel like you are driving for real. Drive all kinds of vehicles with your skill: trucks, station wagons, vans, jeeps, limousines, sports cars, and more by earning coins and level up! You can also change the car’s color to your favorite one! Vehicles cross the street at fast and furious speeds and race down asphalt roads, highways, railroad crossings and roundabouts. The object of this game is to cross the street without crashing into other cars. Drive on the asphalt carefully, but don’t be too cautious! You won’t be able to reach the goal if you hesitate. But beware of traffic lights, roundabouts and railroad crossings... And, of course, the police!",
    "instructions": "",
    "url": "https://html5.gamemonetize.com/0mpht9o0d23fe0w47lmuwnt50nfbxlrg/",
    "category": "Soccer",
    "tags": "drift, drifting, Driving, Game, Games, Prison",
    "thumb": "https://img.gamemonetize.com/0mpht9o0d23fe0w47lmuwnt50nfbxlrg/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "37664",
    "title": "Traffic Racer Ultimate",
    "description": "How far can you drive?!!!!",
    "instructions": "WASD Arrow Keys",
    "url": "https://html5.gamemonetize.com/9u0d7zxvs2ukrn9ofrw1q4kuh76ljnzo/",
    "category": "Racing",
    "tags": "1 Player, 3D, 3D Games, Action, Balance, Car, Cars, drifting, Driving, Fun, Funny, Game, Games, Police, Road, Side Scrolling, Supercars",
    "thumb": "https://img.gamemonetize.com/9u0d7zxvs2ukrn9ofrw1q4kuh76ljnzo/512x384.jpg",
    "width": "800",
    "height": "450"
  },
  {
    "id": "37360",
    "title": "Annoying Traffic",
    "description": "In Slightly Annoying Traffic you have to prevent crashes. You can stop and start cars by clicking on them.",
    "instructions": "Use Your Mouse",
    "url": "https://html5.gamemonetize.com/e8mm5n2k3vqxy23tevc724a9392dk89b/",
    "category": "3D",
    "tags": "3D, Action, Car, Strategy, Street Fighting, Traffic",
    "thumb": "https://img.gamemonetize.com/e8mm5n2k3vqxy23tevc724a9392dk89b/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "32222",
    "title": "Cars Traffic King",
    "description": "In this simple game you will try to control the traffic lights to avoid accidents between cars. You must pass the lights properly to handle the traffic. Feel like a controller of police traffic officer standing in the middle of a dangerous intersection. Try to finish all levels with 3 stars.",
    "instructions": "Manage the traffic light ",
    "url": "https://html5.gamemonetize.com/ky4bdyu5ekok7hbmui4zr7ewsjvdwz8l/",
    "category": "Puzzle",
    "tags": "Board, Brain, Casual, Logic, Puzzle",
    "thumb": "https://img.gamemonetize.com/ky4bdyu5ekok7hbmui4zr7ewsjvdwz8l/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "35831",
    "title": "Speed Traffic - Lane Change Master",
    "description": "Speed Traffic is an exciting car driving game, you will drive your car on a busy road and your mission in this game is to avoid other cars and survive as long as possible. Don't forget to collect coins on the road when you drive. If you want to show your driving talent, come here and create a score. Enjoy the game Speed Traffic!",
    "instructions": "Tap or click ",
    "url": "https://html5.gamemonetize.com/yfe5joqh63ec6patliqoe02aplb8cbly/",
    "category": "Racing",
    "tags": "Boy, Boys, Car, Cars, Fun, H5, HTML5, Kid, Kids, Race, Racing, Traffic",
    "thumb": "https://img.gamemonetize.com/yfe5joqh63ec6patliqoe02aplb8cbly/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "37197",
    "title": "Car Parking: Traffic Jam 3D",
    "description": "With this car puzzle game, you need to park your car by solving the parking jam puzzle. To become the legend 3d class driving, you need to show off your strategic thinking, swipe the car to move it and watch the magic happen when all car finds their way to the road.\" Use your moves wisely to overcome challenges and you will unblock vehicles out of jam. The parking area needs a parking king and we can't wait for you to destroy jam",
    "instructions": "Keyboard Control",
    "url": "https://html5.gamemonetize.com/xu8g06ptjfcyeg2uzgbxj9zt6u2ejjk5/",
    "category": "Racing",
    "tags": "8 Ball Pool, Baby Hazel, Candy, drift, drifting, Driving, Monkey, Monster, Moto, Motorcycle, Parking, Race, Racing, Space",
    "thumb": "https://img.gamemonetize.com/xu8g06ptjfcyeg2uzgbxj9zt6u2ejjk5/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "36379",
    "title": "Traffic Racing Jam",
    "description": "Try to make Close Call on the high way nearest Close call give you more money and more points.",
    "instructions": "A D or Mouse",
    "url": "https://html5.gamemonetize.com/1qd2292uy2hqi6sueyk5ao7m8m8xttg8/",
    "category": "Racing",
    "tags": "1 Player, 3D Games, Action, Adult, Adventure, Android, Best, Boy, Boys, Car, Cars, Casual, drift, drifting, Driving, Game, Games, HTML, HTML5, Race, School, Supercars",
    "thumb": "https://img.gamemonetize.com/1qd2292uy2hqi6sueyk5ao7m8m8xttg8/512x384.jpg",
    "width": "960",
    "height": "600"
  },
  {
    "id": "36574",
    "title": "Refuse traffic jam",
    "description": "This game is about the type of traffic driving a game, the players in the game to simulate closed-loop driving, driving in the game can train their own skills, in the game to carry out a variety of experience, players can feel free in the game, like this game players come to the game to download the game, the players will not regret it!",
    "instructions": "1 There is no beginning or end 2 All the players have to do is drive their own sports cars and smash all the other players to pieces The greater the damage the closer you are to victory In addition to providing damage upgrades the upgrade system al",
    "url": "https://html5.gamemonetize.com/yortbae74md6vw20rgo8sdt2aamv2a67/",
    "category": "3D",
    "tags": "1 Player",
    "thumb": "https://img.gamemonetize.com/yortbae74md6vw20rgo8sdt2aamv2a67/512x384.jpg",
    "width": "750",
    "height": "1334"
  },
  {
    "id": "36295",
    "title": "Police Chase Traffic Car Racer game Traffic Racer",
    "description": "This is a Highway or lanes racing game, speed into Traffic jam Lane splitting to get more points. navigate your way in a straight highway between cars and trucks. Racing game (Traffic Tour) is a new endless arcade racing game that takes you to another level of smooth driving simulations and high graphics quality, designed for the traffic racer fans with advanced features make this racing game the leading cars games for free in google play. Our car racing game 3d offers it all, from exciting street racing, to relaxing free run highway driving with regular car traffic. Over 10 Million Downloads! - Real Racing experience & realistic graphics - Choose your best racing cars and challenge other players in a real-time multiplayer mode - Join 100 different online missions and get prizes by beating your opponents - Send requests and challenge your friends - enjoy car racing with your friends through 1V1 game - Great CRS (car racing system) - the best free racing game in google play KEY FEATURES - Unlimited car racing play - No fuel or time limits - Different camera modes: first person, third person, driver camera and more - Multiple control modes: tilt, buttons or steering wheel - 5 gameplay modes: Multiplayer, Endless, Career, Time Trial, Free Run - 100 missions in career mode - 5 realistic environments: Highway, City, Desert, Rain and snow with day or night times - 40 different cars with the ability to customize colors and wheels - Unlock cars by collecting or buying blueprints - Upgrade cars features: Speed, Handling, and Brakes - Variety of traffic vehicles: Trucks, Buses, Vans,car ,Pickups, SUVs - Multiplayer racing, challenging friends and players from all around the world. - Ability to use the Nitrous (Nitro) feature in multiplayer mode TIPS - Unlock new cars by collecting more Blueprints in endless mode - When driving over 100 km/h, try to overtake traffic cars to get bonus scores and cash - Get extra cash when playing evening and night in endless mode - Driving in opposite direction in two-way gives extra score and cash - Use Nitrous in the right time in multiplayer mode to get the most out of it - Share your results with friends to get extra cash",
    "instructions": "control left right with arrows and race with mouse buttons",
    "url": "https://html5.gamemonetize.com/iecx1b1zmnnz354yv8n1r37kmk56olvb/",
    "category": "Sports",
    "tags": ".io Games, 1 Player, 3D, Action, Adventure, Cars",
    "thumb": "https://img.gamemonetize.com/iecx1b1zmnnz354yv8n1r37kmk56olvb/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "36298",
    "title": "Tank Traffic Racer Game Tank Traffic Racer Game",
    "description": "Become a tank racer and drive through traffic in arcade racing game. Your mission is to destroy cars as many as possible while getting survival as long as possible. *************************** ********Features:********* - Real dynamic game feeling with endless fun. - Beautiful 3D graphics. - Many different Tanks. - Easy driving controls. - Crazy Action. - A lot of explosions and destruction. - View from the cockpit. Try now! Download and play OPPANA GAMES! And enjoy yourself! https://www.facebook.com/OppanaGames https://vk.com/oppana_games While you're thinking, your friend is already playing! Become a tank racer and drive through traffic in arcade racing game. Your mission is to destroy cars as many as possible while getting survival as long as possible. *************************** ********Features:********* - Real dynamic game feeling with endless fun. - Beautiful 3D graphics. - Easy driving controls. - Crazy Action. - A lot of explosions and destruction. - View from the cockpit.",
    "instructions": "use keyboard for left right",
    "url": "https://html5.gamemonetize.com/db3m02dt8sekap7o2z12jh0nb6vi98mh/",
    "category": "Racing",
    "tags": "1 Player, 2D, Adventure, Arcade",
    "thumb": "https://img.gamemonetize.com/db3m02dt8sekap7o2z12jh0nb6vi98mh/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "36103",
    "title": "Super Highway Traffic Racing 3d 2022",
    "description": "Challenging highway car racing game endless car driving racing game additive hd graphics Super new highway traffic car racing real 3d car driving racing game 2022 Enjoy and show highway car racing skills traffic extreme driving racer become best car driver Highway traffic car racing 3d driving racer game legends cars on highway racing tracks. traffic highway racing highway racer brings free offline car driving games with crazy high super speed cars in asphalt highway racing tournament with multiple super sports racing cars. Drive car racing tournaments with luxury awesome cars in new highway racer game high super speed car driving game. Highway traffic car racer game brings rally racer 3d extreme car racing offline games only for you so play car offline games and become a crazy modern driver car pro super driver in smart racing citie",
    "instructions": "keyboard and mouse keyboard contols W - Forward S- brake A- Left D- Right space- Handbrake or brake ",
    "url": "https://html5.gamemonetize.com/dxj19ntyqquctaii1u1u1k5dbtc4ju1f/",
    "category": "Racing",
    "tags": "3D, 3D Games, Adventure, Car, Cars, drift, drifting, Driving, Parking, Racing, Simulation, Simulator, Sport, Supercars, Traffic",
    "thumb": "https://img.gamemonetize.com/dxj19ntyqquctaii1u1u1k5dbtc4ju1f/512x384.jpg",
    "width": "1920",
    "height": "1080"
  },
  {
    "id": "36290",
    "title": "Highway Moto Traffic",
    "description": "Highway Moto Traffic is a fun driving game where you race through traffic. Collect cash and powerups to finish your track.",
    "instructions": "WASD or arrow keys to control motorbike",
    "url": "https://html5.gamemonetize.com/jy1mhyfawlg51f7a6y2sawj77sxf165a/",
    "category": "Racing",
    "tags": "Mobile, Moto, Motorcycle",
    "thumb": "https://img.gamemonetize.com/jy1mhyfawlg51f7a6y2sawj77sxf165a/512x384.jpg",
    "width": "960",
    "height": "600"
  },
  {
    "id": "31823",
    "title": "Traffic Manager",
    "description": "In this simple game you will try to control the traffic lights to avoid accidents between cars. You must pass the lights properly to handle the traffic. Feel like a controller of police traffic officer standing in the middle of a dangerous intersection. Try to finish all levels with 3 stars.",
    "instructions": "Manage the traffic lights",
    "url": "https://html5.gamemonetize.com/khligx9pxiehovc8cw6z7eq1whm1ajub/",
    "category": "Puzzle",
    "tags": "Brain, Hypercasual, Logic, Puzzle, Simulation, Traffic",
    "thumb": "https://img.gamemonetize.com/khligx9pxiehovc8cw6z7eq1whm1ajub/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "34640",
    "title": "City Traffic Control",
    "description": "City Traffic Control is a free online traffic control game. Control traffic in the city and keep it moving.The faster you complete the level, the more points you earn. Avoid accidents, and maintain order by keeping the traffic at a reasonable speed. Do you like playing traffic control games? If yes, then play City Traffic Control online and have fun.There are no traffic laws in this city so you can go wherever you want, but be careful because if you crash into other cars you will have to start over. You will earn points for each car that you deliver to its destination. The more cars you deliver at once, the more points you will earn. City Traffic Control is a free online traffic management game. The goal is to guide the vehicles to their respective destinations as fast as possible. Be careful not to crash into each other or you will have to start the level over again. There are a variety of different vehicles to choose from. Some are faster than others, some can carry more cargo and some are just more durable than others. Once you have chosen your vehicle, you can start the level. Once you have started the level, you will be given a specific amount of time to get from one end of the city to the other. Be careful not to crash into other vehicles or you will have to start the level over again.",
    "instructions": "touch screen or mouse or keyboard",
    "url": "https://html5.gamemonetize.com/zstn7cj6bnyuaa8qehn015895tygpjbn/",
    "category": "Adventure",
    "tags": "Action, Adult, Adventure, Arcade, Boy, Boys, Hot, New, Puzzle",
    "thumb": "https://img.gamemonetize.com/zstn7cj6bnyuaa8qehn015895tygpjbn/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "34282",
    "title": "Traffic Mayhem",
    "description": "Welcome to Trrafic Mayhem If you are looking for a driving game, you are at the right place. Driving requires attention and skill. So with the help of your reflexes, try to reach the finish line without hitting other vehicles and unlock the next level. Good luck",
    "instructions": "Tap or Click to drive",
    "url": "https://html5.gamemonetize.com/n9g34r2dhmi7p9q67m1ck77d3fzvnoi5/",
    "category": "Hypercasual",
    "tags": "Car, Cars, drifting, Driving, Hypercasual, Racing, Strategy, Traffic",
    "thumb": "https://img.gamemonetize.com/n9g34r2dhmi7p9q67m1ck77d3fzvnoi5/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "30765",
    "title": "Air traffic controller",
    "description": "Have you ever dreamed of piloting airplanes when you were a child? With this game, it’s time to realize your dream! Install yourself in the control tower. You can now take control, and help aircraft to land... without causing accidents! Whether it’s a massive aircraft or a small helicopter, you must determine where they land. You must survive as long as possible. Good luck! With this exciting simulation game, you can test your responsiveness and management sense. You can also enjoy a magnificent view with outstanding graphics!",
    "instructions": "You will be able to control the trajectory of the aircraft You decide when and in what order they should land Remember if there is an accident the game is over ",
    "url": "https://html5.gamemonetize.com/cs4j9ddjwkv1j427ov1qudli5b6v2ig9/",
    "category": "Puzzle",
    "tags": "Aircraft, Casual, Helicopter, Management, Puzzle, Simulation, Strategy, Traffic",
    "thumb": "https://img.gamemonetize.com/cs4j9ddjwkv1j427ov1qudli5b6v2ig9/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "33088",
    "title": "Traffic Racer King",
    "description": "Traffic Racer King is undoubtedly one of the most interesting new arcade games this year, with the 3D art style and addictive simulation of real gameplay. If you are a driving game lover, don't miss this game! In the game, you will no longer be restricted by traffic rules, and you don't have to worry about traffic lights. You can enjoy the flying speed and special acceleration function. Whenever the charging button changes color, you can use the acceleration function to surpass others. For all vehicles, you don't have to worry about time.",
    "instructions": "Tap or click ",
    "url": "https://html5.gamemonetize.com/1wndvhs7phy774b3ag3tk2bk12fu2kkx/",
    "category": "Racing",
    "tags": "3D, 3D Games, Boy, Boys, drift, drifting, Fun, Kid, Kids, Race, Racing",
    "thumb": "https://img.gamemonetize.com/1wndvhs7phy774b3ag3tk2bk12fu2kkx/512x384.jpg",
    "width": "1334",
    "height": "750"
  },
  {
    "id": "31824",
    "title": "Traffic puzzle game Linky",
    "description": "Have you always liked city and road building games? well this game may not be for you because in this game you need a real brain ... it's not just decoration ... Cities are displayed on the screen and each city has a number. This number corresponds to the number of roads that leave from this city and connect other cities. You understood ? If so, download this game as soon as possible to be able to appreciate it at its true value.",
    "instructions": "You have to connect cities with the right number of roads no more no less ",
    "url": "https://html5.gamemonetize.com/dmex92zw4pbceztcd1g3iectfng6fyeq/",
    "category": "Puzzle",
    "tags": "Board, Car, Casual, Logic, Puzzle, Road",
    "thumb": "https://img.gamemonetize.com/dmex92zw4pbceztcd1g3iectfng6fyeq/512x384.jpg",
    "width": "800",
    "height": "600"
  },
  {
    "id": "32137",
    "title": "Train Traffic Car Race",
    "description": "Train Traffic Car Race is a 3D car simulation game. You only need to hold the screen to control it to go or stop until it arrive at destination. Remember, pay more attention to the trains on the road. You will fail if you hit them. Now, come to ply! Have fun!",
    "instructions": "Hold to drive",
    "url": "https://html5.gamemonetize.com/z38sqz7e2trflhhd1dsajww4hpfccxxr/",
    "category": "Arcade",
    "tags": "Car, Driving, Kids, Mobile, Race, Skill, Train",
    "thumb": "https://img.gamemonetize.com/z38sqz7e2trflhhd1dsajww4hpfccxxr/512x384.jpg",
    "width": "750",
    "height": "1334"
  },
  {
    "id": "30262",
    "title": "Car Traffic Race",
    "description": "This is actually not a car driving simulation game but a car avoiding arcade game, which is made from 3D cartoon vehicle models. With an unlimited track on the vertical version, you need to collect more gold coins and avoid all the other vehicles on the road. Glad you will enjoy the game and make new records.",
    "instructions": "Tap the two sides of the screen to change tracks",
    "url": "https://html5.gamemonetize.com/0qvb855964kkew909me31p69it98c0k2/",
    "category": "Arcade",
    "tags": "3D, Arcade, Avoid, Boy, Car, Collecting, Highscore, Kid, Mobile, Truck, Unity3D",
    "thumb": "https://img.gamemonetize.com/0qvb855964kkew909me31p69it98c0k2/512x384.jpg",
    "width": "750",
    "height": "1334"
  },
  {
    "id": "30198",
    "title": "Crazy Traffic Racer Online",
    "description": "Crazy Traffic Racer is a free online game. Control your car and win the race. Race your way to the finish line and win as many races as possible. The more races you complete, the greater your chances of winning. Use all of your skills and strategies to defeat other drivers in order to become the best traffic racer on the web! In Crazy Traffic Racer, you will race your way through a city filled with obstacles and dangerous vehicles. Use the arrow keys to drive your car and use the space bar to brake. Race your car against other cars in a variety of circuits to win the race. Use the arrow keys to drive and spacebar to use your brakes. In Crazy Traffic Racer, your objective is to win the race by driving as fast as you can. The game features an intense and frantic atmosphere that will keep you entertained for hours on end. There are many different levels in which you can play the game, each with its own unique set of challenges and rewards.",
    "instructions": "Up Arrow Down Arrow and Left Arrow Right Arrow",
    "url": "https://html5.gamemonetize.com/zl1poijsvtvsu7rq6mm0s7roebv4btuf/",
    "category": "Racing",
    "tags": "endless, Race, Racing",
    "thumb": "https://img.gamemonetize.com/zl1poijsvtvsu7rq6mm0s7roebv4btuf/512x384.jpg",
    "width": "1920",
    "height": "1080"
  },
  {
    "id": "30037",
    "title": "Traffic Car turn",
    "description": "On the roads of large cities, intersections are particularly difficult sections with incredibly busy traffic. The game will take you to one of these intersections, and you will have to deal with traffic control. Stay alert to avoid a traffic accident.",
    "instructions": "Click to move car ",
    "url": "https://html5.gamemonetize.com/i1nxe096pqnykylx1nbiofeiw46jedum/",
    "category": "Racing",
    "tags": "Best, Brain, bus, Car, Cars, Hot, HTML, HTML5, Road, Strategy, Taxi, Traffic, Turn",
    "thumb": "https://img.gamemonetize.com/i1nxe096pqnykylx1nbiofeiw46jedum/512x384.jpg",
    "width": "720",
    "height": "1280"
  },
  {
    "id": "26177",
    "title": "Speed Row Traffic Racing Car",
    "description": "TAre you ready to drive a real traffic racing car in car games online? With extreme car driving races here you can go through an intense action. The vibe of a real traffic racing car will be given to you by it. To make yourself an encounter highway racer, steer your wheel and get started for a cool car racing game. The empowerment of starting with a confidence in real life car driving experience will be increased by this traffic racer game online. Your game plan will be in a road mind mapped. The first track of the highway starts from. Get ready to build up a turbo traffic racer perfectly step by step. To play games online for free just hold the stir. To drive a car in reality follow the way. A straight road will be given to drive your car. Crashing into the other cars should be tried to avoid. Properly hold the break. By creating a proper simulator setup keep the steering handle in your control. This free game has upgraded graphics. It is easy to control. There are various road trips in this 3D html5 game. You have to speed up a real traffic racing car. You will get vibrant racing cars in this best game online. Extreme car driving game speed is thrilling. Crazy speed cars are always everyone's favorite and it reaches the toppest of the thrill. The car racing arcade game with high speed is wanted by everybody. When we are behind the wheels of a crazy speed car and the obligation of not hitting anything, we feel the peak of the real thrill. In the car racing arcade game the speed is thrilling. So, what are you waiting for? Try it now. There is no comparison with the thrill of driving with a real traffic racing car because of its blazing speed. So get ready for some high speed fun with street racing car traffic speed. The sound of an extreme car driving engine with its roaring and tires screeching propels go through our ears as if they were an extension of yourself! The sensation of extreme car driving is incomparable with anything. Highway racer will be able to feel the excitement of street racing car traffic speed in this car racing game. The feeling you get from a turbo traffic racer is just too good to be thought of. The street racing car traffic speed, the humanity in front of your eyes it all comes in cool car games together for an experience that's intense yet still accessible at any age! If you're looking for a thrilling car racing arcade game that can get your blood pumping, then look no further than this fantastic and exciting title. The speed is incredible! The extreme car driving speed is thrilling, and the adrenaline rush that comes with it can't be beaten. A person should feel like they're in a movie when overtaking another car on highways or passing close to other drivers at high highway racers speed because there's nothing more satisfying than knowing your skill set allows you to get ahead of everyone else around you! he speed is thrilling. Everyone says Speeding cars can reach the top of the thrill. The high-speed racing of the Car Racing Arcade Game is what everyone says they want. The thrill can reach its peak when you're behind the wheel, speeding past other cars and trying not to hit anything! The speed is thrilling Car Racing Arcade Game. So if you haven't tried it yet, what are you waiting for? The blazing speed of a car race is nothing compared to the thrill you get when driving. So get ready for some high-speed fun in the Car Racing Arcade Game! The sound of engines roaring and tires screeching propels through your ears as if they were an extension of yourself! The racing sensation is like no other. Car racers will be able to feel the thrill of speeding up and moving around corners at breakneck speeds in this arcade game where there's always something new coming along for you on your journey! The feeling you get from racing is just too good to be true. The speed, the humanity in front of your eyes- it all comes together for an experience that's intense yet still accessible at any age! If you're looking for a thrilling car racing arcade game that can get your blood pumping, then look no further than this fantastic and exciting title. The speed is incredible! The speed is thrilling, and the adrenaline rush that comes with it can't be beaten. A person should feel like they're in a movie when overtaking another car on highways or passing close to other drivers at high speeds because there's nothing more satisfying than knowing your skill set allows you to get ahead of everyone else around you!",
    "instructions": "Left Right Tap to Move Player Car",
    "url": "https://html5.gamemonetize.com/vulc337tjw7ncnc4jr97k2lwm212er4t/",
    "category": "Racing",
    "tags": "Arcade, Car, endless, Race, Racing, Supercars",
    "thumb": "https://img.gamemonetize.com/vulc337tjw7ncnc4jr97k2lwm212er4t/512x384.jpg",
    "width": "720",
    "height": "1280"
  }
]